package com.safetys.zatgov.config;

import java.util.HashMap;

/**
 * Author:Created by Ricky on 2017/11/15.
 * Description:
 */
public class ThirdTypeEnum {
    private static final HashMap<String, String> data = new HashMap();
    public static final String[] typedata={"德清县","长兴县","安吉县",
            "吴兴区","南浔区","湖州开发区","太湖度假区"};
    static{
        data.put("请选择" ,null );
        data.put("武康镇" ,"330521100000" );
        data.put("乾元镇" ,"330521101000" );
        data.put("新市镇" ,"330521102000" );
        data.put("洛舍镇" ,"330521103000" );
        data.put("钟管镇" ,"330521104000" );
        data.put("莫干山镇" ,"330521105000" );
        data.put("雷甸镇" ,"330521110000" );
        data.put("禹越镇" ,"330521113000" );
        data.put("新安镇" ,"330521114000" );
        data.put("筏头乡" ,"330521201000" );
        data.put("三合乡" ,"330521202000" );
        data.put("开发区" ,"330521203000" );
        data.put("科技新城" ,"330521029923" );
        data.put("画溪街道" ,"330522100000" );
        data.put("洪桥镇" ,"330522101000" );
        data.put("李家巷镇" ,"330522102000" );
        data.put("夹浦镇" ,"330522103000" );
        data.put("林城镇" ,"330522104000" );
        data.put("泗安镇" ,"330522105000" );
        data.put("虹星桥镇" ,"330522106000" );
        data.put("和平镇" ,"330522107000" );
        data.put("小浦镇" ,"330522108000" );
        data.put("煤山镇" ,"330522109000" );
        data.put("水口乡" ,"330522200000" );
//		  data.put("二界岭乡" ,"330522201000" );
        data.put("吕山乡" ,"330522202000" );
//		  data.put("吴山乡" ,"330522203000" );
        data.put("白岘乡" ,"330522204000" );
        data.put("槐坎乡" ,"330522205000" );
        data.put("龙山街道" ,"330522207000" );
        data.put("雉城街道" ,"330522208000" );
        data.put("开发区" ,"330522206000" );
        data.put("图影旅游度假区" ,"330522201200" );
        data.put("南太湖产业集聚区" ,"330522201100" );
        data.put("递铺镇" ,"330523100000" );
        data.put("梅溪镇" ,"330523101000" );
//		  data.put("良朋镇" ,"330523102000" );
        data.put("鄣吴镇" ,"330523103000" );
        data.put("杭垓镇" ,"330523104000" );
        data.put("孝丰镇" ,"330523105000" );
        data.put("报福镇" ,"330523106000" );
        data.put("章村镇" ,"330523107000" );
        data.put("天荒坪镇" ,"330523108000" );
        data.put("天子湖镇" ,"330523109000" );
//		  data.put("昆铜乡" ,"330523200000" );
        data.put("溪龙乡" ,"330523201000" );
        data.put("皈山乡" ,"330523204000" );
        data.put("上墅乡" ,"330523205000" );
        data.put("山川乡" ,"330523206000" );
        data.put("昌硕街道" ,"330523207000" );
        data.put("月河街道" ,"330502001000" );
        data.put("朝阳街道" ,"330502002000" );
        data.put("爱山街道" ,"330502003000" );
        data.put("飞英街道" ,"330502004000" );
        data.put("龙泉街道" ,"330502005000" );
        data.put("凤凰街道" ,"330502006000" );
        data.put("康山街道" ,"330502007000" );
        data.put("织里镇" ,"330502100000" );
        data.put("八里店镇" ,"330502101000" );
        data.put("妙西镇" ,"330502102000" );
        data.put("杨家埠街道" ,"330502103000" );
        data.put("埭溪镇" ,"330502104000" );
        data.put("东林镇" ,"330502105000" );
        data.put("道场乡" ,"330502200000" );
        data.put("环渚乡" ,"330502201000" );
        data.put("白雀乡" ,"330502202000" );
        data.put("高新区" ,"330502106000" );
        data.put("南浔镇" ,"330503100000" );
        data.put("双林镇" ,"330503101000" );
        data.put("练市镇" ,"330503102000" );
        data.put("善琏镇" ,"330503103000" );
        data.put("旧馆镇" ,"330503104000" );
        data.put("菱湖镇" ,"330503105000" );
        data.put("和孚镇" ,"330503106000" );
        data.put("千金镇" ,"330503107000" );
        data.put("石淙镇" ,"330503108000" );
        data.put("杨家埠街道" ,"330504001000" );
        data.put("凤凰街道" ,"330504002000" );
        data.put("康山街道" ,"330504003000" );
        data.put("滨湖街道" ,"330505002000" );
        data.put("仁皇山街道" ,"330505003000" );
        data.put("雉城街道" ,"330522201300" );
        data.put("灵峰度假区","330523208000" );
        data.put("旅游企业" ,"330523209000");
        data.put("龙溪街道", "330504004000");






        data.put( null,"");
        data.put( "0","");
        data.put( "330504004000","龙溪街道");
        data.put("330523208000" ,"灵峰度假区");
        data.put("330523209000","旅游企业" );
        data.put("330522201300" ,"雉城街道" );
        data.put("330521100000" ,"武康镇" );
        data.put("330521101000", "乾元镇" );
        data.put("330521102000", "新市镇" );
        data.put("330521103000", "洛舍镇" );
        data.put("330521104000", "钟管镇" );
        data.put("330521105000", "莫干山镇" );
        data.put("330521110000", "雷甸镇" );
        data.put("330521113000" ,"禹越镇" );
        data.put("330521114000" ,"新安镇" );
        data.put("330521201000" ,"筏头乡" );
        data.put("330521202000","三合乡" );
        data.put("330521203000" ,"开发区" );
        data.put("330521029923" ,"科技新城" );
        data.put("330522100000" ,"画溪街道" );
        data.put("330522101000" ,"洪桥镇" );
        data.put("330522102000" ,"李家巷镇" );
        data.put("330522103000" ,"夹浦镇" );
        data.put("330522104000" ,"林城镇" );
        data.put("330522105000" ,"泗安镇" );
        data.put("330522106000","虹星桥镇" );
        data.put("330522107000", "和平镇" );
        data.put("330522108000" ,"小浦镇" );
        data.put("330522109000" ,"煤山镇" );
        data.put("330522200000", "水口乡" );
//		  data.put("330522201000", "二界岭乡" );
        data.put("330522202000","吕山乡"  );
//		  data.put("330522203000" ,"吴山乡" );
        data.put("330522204000" ,"白岘乡" );
        data.put("330522205000" ,"槐坎乡" );
        data.put("330522207000" ,"龙山街道" );
        data.put("330522208000" ,"雉城街道" );
        data.put("330522206000" ,"开发区" );
        data.put("330522201200", "图影旅游度假区" );
        data.put("330522201100", "南太湖产业集聚区" );
        data.put("330523100000" ,"递铺镇" );
        data.put("330523101000" ,"梅溪镇" );
//		  data.put("330523102000" ,"良朋镇" );
        data.put("330523103000", "鄣吴镇" );
        data.put("330523104000" ,"杭垓镇" );
        data.put("330523105000" ,"孝丰镇" );
        data.put("330523106000" ,"报福镇" );
        data.put("330523107000" ,"章村镇" );
        data.put("330523108000" ,"天荒坪镇" );
        data.put("330523109000" ,"天子湖镇" );
//		  data.put("330523200000" ,"昆铜乡" );
        data.put("330523201000" ,"溪龙乡" );
        data.put("330523204000" ,"皈山乡" );
        data.put("330523205000" ,"上墅乡" );
        data.put("330523206000" ,"山川乡" );
        data.put("330523207000", "昌硕街道" );
        data.put("330502001000", "月河街道" );
        data.put("330502002000", "朝阳街道" );
        data.put("330502003000" ,"爱山街道" );
        data.put("330502004000" ,"飞英街道" );
        data.put("330502005000" ,"龙泉街道" );
        data.put("330502006000" ,"凤凰街道" );
        data.put("330502007000", "康山街道" );
        data.put("330502100000", "织里镇" );
        data.put("330502101000" ,"八里店镇" );
        data.put("330502102000" ,"妙西镇" );
        data.put("330502103000" ,"杨家埠街道" );
        data.put("330502104000" ,"埭溪镇" );
        data.put("330502105000" ,"东林镇" );
        data.put("330502200000" ,"道场乡" );
        data.put("330502201000" ,"环渚乡" );
        data.put("330502202000","白雀乡" );
        data.put("330502106000" ,"高新区" );
        data.put("330503100000" ,"南浔镇" );
        data.put("330503101000" ,"双林镇" );
        data.put("330503102000" ,"练市镇" );
        data.put("330503103000" ,"善琏镇" );
        data.put("330503104000" ,"旧馆镇" );
        data.put("330503105000" ,"菱湖镇" );
        data.put("330503106000" ,"和孚镇" );
        data.put("330503107000" ,"千金镇" );
        data.put("330503108000" ,"石淙镇" );
        data.put("330504001000" ,"杨家埠街道" );
        data.put("330504002000" ,"凤凰街道" );
        data.put("330504003000" ,"康山街道" );
        data.put("330505002000" ,"滨湖街道" );
        data.put("330505003000","仁皇山街道"  );
    }
    public static String getValue(String name){
        return data.get(name);
    }
}
